maybecat-wow/esp32-breathing/main/app_main.c
    /* Send buffer — lwIP default is fine, but be explicit */
    int sndbuf = TCP_TX_BUF_SIZE * 4;
    setsockopt(sock, SOL_SOCKET, SO_SNDBUF, &sndbuf, sizeof(sndbuf));

    ESP_LOGI(TAG, "Connecting to %s:%d …", CONFIG_CSI_TCP_HOST, CONFIG_CSI_TCP_PORT);
    if (connect(sock, (struct sockaddr *)&dest, sizeof(dest)) != 0) {
        ESP_LOGE(TAG, "connect() failed: errno %d", errno);
        close(sock);
        return -1;
    }

    ESP_LOGI(TAG, "TCP connected to %s:%d", CONFIG_CSI_TCP_HOST, CONFIG_CSI_TCP_PORT);
    return sock;
}

/**
 * Send exactly `len` bytes.  Closes the socket on error so the
 * reconnect task will re-establish the connection.
 * Must be called with s_tcp_mutex held.
 */
static void tcp_send_locked(const char *buf, int len)
{
    if (s_tcp_sock < 0 || len <= 0) return;

    int sent = 0;
    while (sent < len) {
        int n = send(s_tcp_sock, buf + sent, len - sent, 0);
        if (n < 0) {
            ESP_LOGW(TAG, "send() failed (errno %d) — closing socket", errno);
            close(s_tcp_sock);
            s_tcp_sock    = -1;
            s_session_info_sent = false;
            return;
        }
        sent += n;
    }
    /* Drives the 1 Hz heartbeat in tcp_reconnect_task. */
    s_last_tx_us = esp_timer_get_time();
}

/**
 * Build and send a SESSION_INFO message. Called from tcp_reconnect_task on
 * each successful connect. Must be called with s_tcp_mutex held.
 */
static void tcp_send_session_info_locked(void)
{
    if (s_tcp_sock < 0 || s_session_info_sent) return;

    wifi_ap_record_t ap = {0};
    uint8_t channel = 0;
    uint8_t mac[6] = {0};
    if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
        channel = ap.primary;
    }
    esp_wifi_get_mac(WIFI_IF_STA, mac);

#if CONFIG_IDF_TARGET_ESP32S3
    const uint8_t chip_id = 2;
#else
    const uint8_t chip_id = 1;
#endif

    uint8_t buf[sizeof(csi_msg_header_t) + sizeof(csi_session_info_t)];
    csi_msg_header_t *hdr = (csi_msg_header_t *)buf;
    csi_session_info_t *info =
        (csi_session_info_t *)(buf + sizeof(csi_msg_header_t));

    hdr->type   = MSG_SESSION_INFO;
    hdr->length = sizeof(csi_session_info_t);

    info->chip_id        = chip_id;
    info->csi_format     = 0;  /* legacy HT LLTF */
    info->csi_bytes      = 128;
    memcpy(info->mac, mac, 6);
    info->channel        = channel;
    info->reserved       = 0;
    info->sample_rate_hz = (uint16_t)CONFIG_SEND_FREQUENCY;
    info->boot_id        = s_boot_id;
    info->esp_time_us    = (uint64_t)esp_timer_get_time();

    tcp_send_locked((const char *)buf, sizeof(buf));
    s_session_info_sent = true;
}

/**
 * Emit a one-line heartbeat so the capture host can detect a silent link
 * even during long periods with no CSI (e.g. AP channel switch). Called
 * from tcp_reconnect_task when no send has happened in the last second.
 * Must be called with s_tcp_mutex held.
 */
static void tcp_send_heartbeat_locked(void)
{
    if (s_tcp_sock < 0 || !s_session_info_sent) return;

    wifi_ap_record_t ap = {0};
    int8_t rssi = 0;
    uint8_t channel = 0;
    if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
        rssi = (int8_t)ap.rssi;
        channel = ap.primary;
    }
    int64_t now_us = esp_timer_get_time();
    uint32_t uptime_s = (uint32_t)(now_us / 1000000);

    uint8_t buf[sizeof(csi_msg_header_t) + sizeof(csi_heartbeat_t)];
    csi_msg_header_t *hdr = (csi_msg_header_t *)buf;
    csi_heartbeat_t  *hb  = (csi_heartbeat_t *)(buf + sizeof(csi_msg_header_t));

    hdr->type   = MSG_HEARTBEAT;
    hdr->length = sizeof(csi_heartbeat_t);

    hb->esp_time_us      = (uint64_t)now_us;
    hb->rssi             = rssi;
    hb->channel          = channel;
    hb->uptime_s         = uptime_s;
    hb->reconnect_count  = s_reconnect_count;
    hb->last_disc_reason = (uint8_t)s_last_disc_reason;

    tcp_send_locked((const char *)buf, sizeof(buf));
}

/**
 * Background task: drains the CSI stream buffer and sends bytes over TCP.
 * Runs at a lower priority than the Wi-Fi task and is the ONLY place that
 * does a blocking send(). Keeps the Wi-Fi task free of TCP back-pressure.
 */
static void tcp_writer_task(void *arg)
{
    static char buf[TCP_TX_BUF_SIZE];
    while (true) {
        /* Block until at least one byte is available. */
        size_t n = xStreamBufferReceive(s_tx_stream, buf, sizeof(buf),
                                        portMAX_DELAY);
        if (n == 0) continue;

        xSemaphoreTake(s_tcp_mutex, portMAX_DELAY);
        /* SESSION_INFO is sent on connect from tcp_reconnect_task, so by the
           time we have data the socket is either healthy or the reconnect
           task is currently bringing it back up. In the latter case, drop. */
        if (s_tcp_sock >= 0 && s_session_info_sent) {
            tcp_send_locked(buf, (int)n);
        }
        xSemaphoreGive(s_tcp_mutex);
    }
}

/**
 * Background task: keeps the TCP connection alive, reconnecting whenever
 * it drops, and emitting a 1 Hz heartbeat while connected.
 *
 * Reconnect uses exponential backoff (500 ms → 30 s) so a long host outage
 * doesn't hammer the network, but a quick bounce recovers within ~500 ms.
 */
static void tcp_reconnect_task(void *arg)
{
    uint32_t backoff_ms = TCP_RECONNECT_BACKOFF_MIN_MS;
    int64_t  last_stats_us = 0;
    uint32_t last_total = 0, last_accepted = 0;

    while (true) {
        /* Every ~5 s, report CSI frame counters to the serial monitor. Lets
           operators see at a glance whether frames are arriving at all and
           whether the BSSID filter is dropping them. */
        int64_t now_us = esp_timer_get_time();
        if (now_us - last_stats_us >= 5000000) {
            uint32_t total    = s_csi_frames_total;
            uint32_t accepted = s_csi_frames_accepted;
            wifi_ap_record_t ap = {0};
            int rssi = 0;
            uint8_t channel = 0;
            if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
                rssi    = ap.rssi;
                channel = ap.primary;
            }
            ESP_LOGI(TAG,
                "CSI stats: total=%lu (+%lu) accepted=%lu (+%lu) dropped=%lu rssi=%d ch=%u in 5 s",
                (unsigned long)total,    (unsigned long)(total    - last_total),
                (unsigned long)accepted, (unsigned long)(accepted - last_accepted),
                (unsigned long)s_csi_frames_dropped,
                rssi, channel);
            last_total     = total;
            last_accepted  = accepted;
            last_stats_us  = now_us;
        }

        xSemaphoreTake(s_tcp_mutex, portMAX_DELAY);
        bool connected = (s_tcp_sock >= 0);
        xSemaphoreGive(s_tcp_mutex);

        if (!connected) {
            int sock = tcp_connect();
            xSemaphoreTake(s_tcp_mutex, portMAX_DELAY);
            s_tcp_sock    = sock;
            s_session_info_sent = false;   /* re-send SESSION_INFO on new connection */
            if (sock >= 0) {
                s_last_tx_us = esp_timer_get_time();
                /* Send SESSION_INFO immediately so capture.py's recv timeout
                   can't fire before the first CSI frame arrives (which may
                   be never if ping is blocked). After this, heartbeats keep
                   the link alive and diagnosable even with zero CSI. */
                tcp_send_session_info_locked();
            }
            xSemaphoreGive(s_tcp_mutex);

            if (sock < 0) {
                vTaskDelay(pdMS_TO_TICKS(backoff_ms));
                backoff_ms <<= 1;
                if (backoff_ms > TCP_RECONNECT_BACKOFF_MAX_MS) {
                    backoff_ms = TCP_RECONNECT_BACKOFF_MAX_MS;
                }
            } else {
                backoff_ms = TCP_RECONNECT_BACKOFF_MIN_MS;
            }
        } else {
            /* Connected: poll slowly and emit a heartbeat if the CSI path
               has been quiet for ≥1 s. */
            xSemaphoreTake(s_tcp_mutex, portMAX_DELAY);
            int64_t idle_us = esp_timer_get_time() - s_last_tx_us;
            if (s_tcp_sock >= 0 && idle_us >= TCP_HEARTBEAT_INTERVAL_US) {
                tcp_send_heartbeat_locked();
            }
            xSemaphoreGive(s_tcp_mutex);

            vTaskDelay(pdMS_TO_TICKS(TCP_CONNECTED_POLL_MS));
        }
    }
}

/* ── CSI callback ────────────────────────────────────────────────────────── */

static void wifi_csi_rx_cb(void *ctx, wifi_csi_info_t *info)
{
    if (!info || !info->buf) {
        ESP_LOGW(TAG, "<%s> wifi_csi_cb", esp_err_to_name(ESP_ERR_INVALID_ARG));
        return;
    }

