maybecat-wow/esp32-breathing/main/app_main.c
    s_csi_frames_total++;

    /* Filter by AP BSSID — only frames from our router. */
    if (memcmp(info->mac, ctx, 6)) {
        return;
    }

    s_csi_frames_accepted++;

    if (s_tx_stream == NULL) return;

    const wifi_pkt_rx_ctrl_t *rx_ctrl = &info->rx_ctrl;
    static uint32_t s_seq = 0;

    /* Cap CSI byte count at a sane size; LLTF gives 128 bytes. Anything
       wildly different is hardware glitch territory. */
    int csi_len = info->len;
    if (csi_len < 0 || csi_len > 256) {
        ESP_LOGW(TAG, "unexpected CSI len=%d — dropping frame", info->len);
        return;
    }

    /* Build the entire message in one stack buffer so we enqueue atomically. */
    uint8_t buf[sizeof(csi_msg_header_t) + sizeof(csi_frame_meta_t) + 256];
    csi_msg_header_t *hdr = (csi_msg_header_t *)buf;
    csi_frame_meta_t *meta =
        (csi_frame_meta_t *)(buf + sizeof(csi_msg_header_t));
    uint8_t *csi_dst =
        buf + sizeof(csi_msg_header_t) + sizeof(csi_frame_meta_t);

    hdr->type   = MSG_CSI_FRAME;
    hdr->length = sizeof(csi_frame_meta_t) + csi_len;

    meta->local_timestamp_us = (uint32_t)rx_ctrl->timestamp;
    meta->seq                = s_seq++;
    meta->rssi               = (int8_t)rx_ctrl->rssi;
    meta->noise_floor        = (int8_t)rx_ctrl->noise_floor;
    meta->rate               = (uint8_t)rx_ctrl->rate;
    meta->first_word_invalid = (uint8_t)info->first_word_invalid;
    meta->len                = (uint16_t)csi_len;

    memcpy(csi_dst, info->buf, csi_len);

    size_t total = sizeof(csi_msg_header_t) + sizeof(csi_frame_meta_t) + csi_len;
    size_t sent = xStreamBufferSend(s_tx_stream, buf, total, 0);
    if (sent != total) {
        s_csi_frames_dropped++;
    }
}

/* ── Wi-Fi CSI init ──────────────────────────────────────────────────────── */

static void wifi_csi_init(void)
{
    wifi_csi_config_t csi_config = {
        .lltf_en           = true,
        .htltf_en          = false,
        .stbc_htltf2_en    = false,
        .ltf_merge_en      = true,
        .channel_filter_en = true,
        .manu_scale        = true,
        .shift             = true,
    };

    static wifi_ap_record_t s_ap_info = {0};
    ESP_ERROR_CHECK(esp_wifi_sta_get_ap_info(&s_ap_info));
    ESP_ERROR_CHECK(esp_wifi_set_csi_config(&csi_config));
    ESP_ERROR_CHECK(esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, s_ap_info.bssid));
    ESP_ERROR_CHECK(esp_wifi_set_csi(true));
}

/* ── Ping router (generates the CSI traffic) ─────────────────────────────── */

static esp_err_t wifi_ping_router_start(void)
{
    static esp_ping_handle_t ping_handle = NULL;

    esp_ping_config_t ping_config = ESP_PING_DEFAULT_CONFIG();
    ping_config.count           = 0;
    ping_config.interval_ms     = 1000 / CONFIG_SEND_FREQUENCY;
    ping_config.task_stack_size = 3072;
    ping_config.data_size       = 1;

    esp_netif_ip_info_t local_ip;
    esp_netif_get_ip_info(esp_netif_get_handle_from_ifkey("WIFI_STA_DEF"), &local_ip);
    ESP_LOGI(TAG, "got ip:" IPSTR ", gw: " IPSTR,
             IP2STR(&local_ip.ip), IP2STR(&local_ip.gw));

    ping_config.target_addr.u_addr.ip4.addr = ip4_addr_get_u32(&local_ip.gw);
    ping_config.target_addr.type = ESP_IPADDR_TYPE_V4;

    esp_ping_callbacks_t cbs = {0};
    esp_ping_new_session(&ping_config, &cbs, &ping_handle);
    esp_ping_start(ping_handle);

    return ESP_OK;
}

/* ── Wi-Fi provisioning (ESPTouch) ──────────────────────────────────────── */

#define NVS_NAMESPACE   "wifi_creds"
#define NVS_KEY_SSID    "ssid"
#define NVS_KEY_PASS    "password"

#define WIFI_CONNECTED_BIT  BIT0
#define WIFI_FAIL_BIT       BIT1
#define ESPTOUCH_DONE_BIT   BIT2

static EventGroupHandle_t s_wifi_event_group;
static bool s_has_stored_creds  = false;
/* Latched true on first successful IP_EVENT_STA_GOT_IP and never cleared.
   Used to prevent NVS credential erasure after a mid-night disconnect —
   overnight glitches must not disable the sensor until morning. */
static bool s_ever_connected    = false;
static int  s_auth_fail_count   = 0;   /* consecutive auth-class failures before first association */
static int  s_reconnect_attempt = 0;   /* exponential-backoff counter, reset on GOT_IP */
static esp_timer_handle_t s_wifi_reconnect_timer = NULL;

/* Helpers for the reason-aware disconnect policy. */
static bool wifi_reason_is_auth(int reason)
{
    switch (reason) {
        case WIFI_REASON_AUTH_FAIL:
        case WIFI_REASON_AUTH_EXPIRE:
        case WIFI_REASON_HANDSHAKE_TIMEOUT:
        case WIFI_REASON_MIC_FAILURE:
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
            return true;
        default:
            return false;
    }
}

static void wifi_reconnect_timer_cb(void *arg)
{
    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_connect() in backoff cb: %s", esp_err_to_name(err));
    }
}

/* Schedule the next esp_wifi_connect() after `delay_ms` without blocking
   the default event loop task. Creates the one-shot timer on first use. */
static void wifi_schedule_reconnect(uint32_t delay_ms)
{
    if (s_wifi_reconnect_timer == NULL) {
        const esp_timer_create_args_t args = {
            .callback = &wifi_reconnect_timer_cb,
            .name     = "wifi_reconn",
        };
        if (esp_timer_create(&args, &s_wifi_reconnect_timer) != ESP_OK) {
            /* Fall back to an immediate connect; worst case the next
               disconnect schedules it again. */
            esp_wifi_connect();
            return;
        }
    }
    esp_timer_stop(s_wifi_reconnect_timer);   /* harmless if not armed */
    esp_timer_start_once(s_wifi_reconnect_timer, (uint64_t)delay_ms * 1000);
}

static bool load_wifi_credentials(char *ssid, size_t ssid_len,
                                   char *password, size_t pass_len)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NAMESPACE, NVS_READONLY, &h) != ESP_OK) return false;
    bool ok = (nvs_get_str(h, NVS_KEY_SSID, ssid, &ssid_len) == ESP_OK &&
               nvs_get_str(h, NVS_KEY_PASS, password, &pass_len) == ESP_OK);
    nvs_close(h);
    return ok;
}

static void save_wifi_credentials(const char *ssid, const char *password)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NAMESPACE, NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_str(h, NVS_KEY_SSID, ssid);
    nvs_set_str(h, NVS_KEY_PASS, password);
    nvs_commit(h);
    nvs_close(h);
}

